{
  "==content_list==": [
    {
      "flow_type": "global",
      "flow_subtype": "legal_terms",
      "flow_name": "legal_terms_global",
      "status": "released"
    },
    {
      "flow_type": "template",
      "flow_subtype": "legal_terms",
      "flow_name": "accept_terms",
      "status": "released"
    },
    {
      "flow_type": "template",
      "flow_subtype": "legal_terms",
      "flow_name": "accept_terms_warning",
      "status": "released"
    },
    {
      "flow_type": "template",
      "flow_subtype": "legal_terms",
      "flow_name": "app_menu_terms",
      "status": "released"
    },
    {
      "flow_type": "template",
      "flow_subtype": "legal_terms",
      "flow_name": "app_menu_privacy_policy",
      "status": "released"
    },
    {
      "flow_type": "data_list",
      "flow_subtype": "legal_terms",
      "flow_name": "privacy_policy",
      "status": "released",
      "data_list_name": "privacy_policy"
    },
    {
      "flow_type": "data_list",
      "flow_subtype": "legal_terms",
      "flow_name": "terms_and_conditions",
      "status": "released",
      "data_list_name": "terms_and_conditions"
    }
  ],
  "legal_terms_global": [
    {
      "type": "declare_global_constant",
      "name": "terms_and_conditions",
      "value": "Terms & Conditions"
    },
    {
      "type": "declare_global_constant",
      "name": "privacy_policy",
      "value": "Privacy Policy"
    },
    {
      "type": "declare_global_constant",
      "name": "deployment_terms_field",
      "value": "terms_v20241205_accepted",
      "exclude_from_translation": true
    },
    {
      "type": "declare_global_constant",
      "name": "deployment_terms_text",
      "value": "5 December 2024",
      "exclude_from_translation": true
    }
  ],
  "accept_terms": [
    {
      "type": "text",
      "name": "text_1",
      "value": "By providing your consent below you acknowledge reading and accepting the @global.terms_and_conditions and @global.privacy_policy. The most important commitments are:\n1. This is, and will always be, a fully free app.\n2. Your data will never be sold. We are not for profit.\n3. By using the app you are helping to make the app better for you and others.\n4. Your anonymised data may be used for research purposes by our @global.app_name team."
    },
    {
      "type": "button",
      "name": "button_1",
      "value": "@global.terms_and_conditions",
      "action_list": "click | pop_up: app_menu_terms | fullscreen: true"
    },
    {
      "type": "button",
      "name": "button_2",
      "value": "@global.privacy_policy",
      "action_list": "click | pop_up: app_menu_privacy_policy | fullscreen: true"
    },
    {
      "type": "text",
      "name": "text_2",
      "value": "These policies are still under construction. We value advice and input to improve them."
    },
    {
      "type": "begin_display_group",
      "name": "dg_checkbox"
    },
    {
      "type": "simple_checkbox",
      "name": "checkbox",
      "parameter_list": "align: left"
    },
    {
      "type": "text",
      "name": "text",
      "value": "I consent to the commitments stated above.",
      "parameter_list": "style: emphasised",
      "style_list": "flex:1"
    },
    {
      "type": "end_display_group"
    },
    {
      "type": "button",
      "name": "button_completed",
      "value": "Continue",
      "action_list": "click | pop_up: accept_terms_warning",
      "parameter_list": "style:navigation;",
      "condition": "!@local.checkbox"
    },
    {
      "type": "button",
      "name": "button_completed",
      "value": "Continue",
      "action_list": "click | emit: completed;\nclick | set_field: @global.deployment_terms_field: true;",
      "parameter_list": "style:navigation;",
      "condition": "@local.checkbox"
    },
    {
      "type": "text",
      "name": "spacer",
      "value": "Last updated: @global.deployment_terms_text"
    }
  ],
  "accept_terms_warning": [
    {
      "type": "text",
      "name": "text",
      "value": "You can only move on and access the app if you provide your consent."
    }
  ],
  "app_menu_terms": [
    {
      "name": "show_title",
      "value": true
    },
    {
      "type": "title",
      "name": "title",
      "value": "@global.terms_and_conditions",
      "condition": "!!(@local.show_title)"
    },
    {
      "type": "begin_items",
      "name": "items",
      "value": "@data.terms_and_conditions"
    },
    {
      "type": "text",
      "name": "title_@item.id",
      "value": "@item.title",
      "condition": "@item.title",
      "parameter_list": "style: emphasised"
    },
    {
      "type": "text",
      "name": "text_@item.id",
      "value": "@item.text",
      "condition": "@item.text"
    },
    {
      "type": "end_items"
    }
  ],
  "app_menu_privacy_policy": [
    {
      "name": "show_title",
      "value": true
    },
    {
      "type": "title",
      "name": "title",
      "value": "@global.privacy_policy",
      "condition": "!!(@local.show_title)"
    },
    {
      "type": "begin_items",
      "name": "items",
      "value": "@data.privacy_policy"
    },
    {
      "type": "text",
      "name": "title_@item.id",
      "value": "@item.title",
      "condition": "@item.title",
      "parameter_list": "style: emphasised"
    },
    {
      "type": "text",
      "name": "text_@item.id",
      "value": "@item.text",
      "condition": "@item.text"
    },
    {
      "type": "end_items"
    }
  ],
  "privacy_policy": [
    {
      "id": "section_0",
      "text::eng": "Your data is important to us. This @global.privacy_policy sets out our policies for the collection, use, and disclosure of personal information in the use of @global.app_name.\n\n@global.app_name is a free app version of the Parenting for Lifelong Health for Young Children programme and designed for parents and caregivers of children aged 2 to 9 years.\n\n@global.app_name is brought to you by the collaboration of partners including Parenting for Lifelong Health, University of Oxford, IDEMS International, INNODEMS, and the Child Protection Office in the Ministry of Health - State of Kuwait (‘the @global.app_name team’).\n\nPlease read this @global.privacy_policy carefully. By downloading or using the app, you agree to the collection and use of information in relation to this policy. By using the @global.app_name, you agree to these terms. Please read the policy before sharing any information.\n\nThe terms used in this @global.privacy_policy have the same meanings as in our @global.terms_and_conditions, which are accessible within the app, unless otherwise defined in this @global.privacy_policy."
    },
    {
      "id": "section_1",
      "title::eng": "Children’s Privacy",
      "text::eng": "@global.app_name isn’t meant for children under 18, and we do not knowingly gather personal details from users directly in this age group. "
    },
    {
      "id": "section_2",
      "title::eng": "What information does the app collect about you and how do we use it?",
      "text::eng": "_Personal Data_\nFor the purpose of this @global.privacy_policy, 'personal data' means any information that enables us to identify an individual, directly or indirectly. We collect data as follows:\n- App usage metrics\n- Module completion data\n- User engagement \n- Drop-off data\n\nAll data collected is linked to your unique ParentApp identification number. The ParentApp identification number produced within the app may also be used to link with any out of app surveys conducted.\n\nWhilst your rights are governed by the laws and regulations of the State of Kuwait, we also acknowledge the processing of your personal data through i) Legitimate Interests - Art. 6(1)(f) GDPR, for data collected for analytic purposes as well as ii) Consent - Art. 6(1)(a) GDPR.\n\n_Log Data_\nWhenever you use our app, we collect data and information (through third party services) on your phone called Log Data. This Log Data includes information such as a truncated device Internet Protocol (\"IP\") address, device name, operating system version, the configuration of the app when utilising our app, the time, date and your intentions within the app (which include but are not limited to any app buttons clicked or pages visited.)\n\n_Cookies_\nCookies are small files that store data, often used to save user-specific information. They allow websites and apps to retrieve this stored information, enabling a more personalised and efficient user experience. This includes recognising repeated usage, facilitating a visitor's access to and use of the site, and allow a site to track usage behavior and compile aggregate data that will allow content improvement.\n\nWe use a number of third party services (see relevant section below) to support the functioning of the app. We use third party cookies through Firebase and first party cookies through Matomo. In short, first-party cookies are from @global.app_name, and third-party cookies come from other places as described.\n\nFor further information on the handling of cookies see below:\n- [Firebase](https://firebase.google.com/support/privacy)\n- [Matomo](https://matomo.org/blog/2020/02/web-analytics-cookies-gdpr/)\n\nYou have the option to adjust your browser settings to decline all or specific browser cookies or to notify you when sites initiate or access cookies. For android devices this should be done on the google chrome app. Remember, disabling cookies can affect the functionality of websites or web apps, as they may rely on these cookies for essential features. Always be sure about your decision before making these changes.\n\n_Feedback Submissions_\nYour feedback on the app is important to us. The feedback you provide allows us to identify and fix bugs, understand user preferences, and make enhancements that better meet your needs. We shall always anonymise your personal information when sharing and publishing your feedback.\n\n_Aggregate Data_\nYour data is important to the @global.app_name team for broader research purposes. Aggregate data is always anonymised."
    },
    {
      "id": "section_3",
      "title::eng": "Why do you collect such data as described?",
      "text::eng": "We process your data to provide support to you as a parent / caregiver as well as process your data to communicate when you contact us, for security reasons as well as research purposes (see section ‘How is information shared?’). The primary research purpose includes looking to investigate the extent to which @global.app_name can support the interactions of parents and caregivers of young children. Parents and caregivers will be receiving primary parenting messages by accessing the modules of the app as well as enjoy shared activities with their child. During the course of research, the study team may use aggregated and anonymised data from the app for further research projects. Finally, please note that we may process your data without your knowledge or consent, where this is required or permitted by law."
    },
    {
      "id": "section_4",
      "title::eng": "Who has access to information shared?",
      "text::eng": "Access to log data collected via the app is restricted to a limited number of the @global.app_name team, as well as authorised contractors, who need it to perform their duties related to the app's operation. Data access is strictly on a need-to-know basis, and all team members are expected to handle the data with care and respect for privacy.\n\nYou agree that your personal information may be shared with third parties such as researchers and partners involved in the improvement or implementation of the app including those outside your country. Prior to the disclosure of information with research partners we will make anonymous to the extent possible and where appropriate information such as log data. In reading and accepting this @global.privacy_policy, you permit us to use your anonymised data in published research.\n"
    },
    {
      "id": "section_5",
      "title::eng": "How is information shared?",
      "text::eng": "You agree that we may transfer your log data outside your country, for example, to administer cloud services. We will ensure that any country, company or person that we pass your personal information to agrees to treat your information with the same level of protection as we are obliged to.\n\n_Legal_\nThe information that we request will be retained by us and used as described in this @global.privacy_policy."
    },
    {
      "id": "section_6",
      "title::eng": "What about third-party service providers and websites?",
      "text::eng": "The app does use third party services that may collect information used to identify you. We do so for the following reasons:\n-   To facilitate our app\n-   To provide the app on our behalf\n-   To perform app-related services; or\n-   To assist us in analysing how our app is used.\n\nWe want to inform users of this app that these third parties have access to your Personal Information. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose.\n\nLinks to the privacy policies of third-party service providers used by the app:\n-   [Google Play Services](https://www.google.com/policies/privacy/)\n-   [Google Analytics for Firebase](https://firebase.google.com/policies/analytics)\n-   [Matomo](https://matomo.org/privacy-policy/)\n-   [Supabase](https://supabase.com/privacy)\n\nThis app may contain links to other sites that are not covered by this @global.privacy_policy. If you click on a third-party link, you will be directed to that site. This @global.privacy_policy applies only to the processing of your information by this app. It does not address, and we are not responsible for, the privacy, information, or other practices of any third parties, including any third party operating any site or service to which this app links to."
    },
    {
      "id": "section_7",
      "title::eng": "How long do we keep your data?",
      "text::eng": "We will retain your personal information for as long as we need it to fulfil our purposes, including any relating to app services as well as legal, accounting, or reporting requirements."
    },
    {
      "id": "section_8",
      "title::eng": "How do we keep your data secure?",
      "text::eng": "We value your trust in providing us your personal information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, and we cannot guarantee its absolute security. We also reserve the right to the storage of your data on third party servers or databases outside of the listed @global.app_name team (refer to the section on Third Party Service Providers and Websites). Therefore usage of the app is at your own risk."
    },
    {
      "id": "section_9",
      "title::eng": "Limitations of Liability for Information Disclosure",
      "text::eng": "We are not liable for how you or third parties use or misuse information that is transmitted or received through the apps tools and services."
    },
    {
      "id": "section_10",
      "title::eng": "Your data protection rights",
      "text::eng": "Whilst your rights are governed by the laws and regulations of the State of Kuwait, we also acknowledge:\n\n_Your right of access_ - You have the right to ask us for copies of your personal information.\n\n_Your right to rectification_ - You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\n\n_Your right to erasure_ - You have the right to ask us to erase your personal information in certain circumstances.\n\n_Your right to withdraw consent for data processing at any time_ - You can choose to halt the processing of your data if consent was the legal basis for handling your information.\n\n_Your right to restriction of processing_ - You have the right to ask us to restrict the processing of your personal information in certain circumstances.\n\n_Your right to object to processing_ - You have the right to object to the processing of your personal information in certain circumstances.\n\n_Your right to data portability_ - You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\n\nYou are not required to pay any charge for exercising your rights. Depending on the circumstances and the nature of your request it may not be possible for us to do what you have asked, for example, where there is a statutory or contractual requirement for us to process your data and it would not be possible to fulfil our legal obligations if we were to stop. "
    },
    {
      "id": "section_11",
      "title::eng": "Removing the app",
      "text::eng": "We are sorry if you find our app no longer useful. Should you decide to remove our app, we may still retain some of your data (although anonymised) to troubleshoot, aid in investigations, comply with legal requirements or to add to our existing research data sets."
    },
    {
      "id": "section_12",
      "title::eng": "Changes to the @global.privacy_policy",
      "text::eng": "We may update our @global.privacy_policy from time to time. You waive your right to be notified directly of changes and are advised to review this page periodically for any updates. Your continued use of the app suggests you agree to subsequent revisions of the @global.privacy_policy."
    },
    {
      "id": "section_13",
      "title::eng": "Contact Us",
      "text::eng": "If you have any questions or suggestions about our @global.privacy_policy, complaints or otherwise do not hesitate to contact us at <apps@idems.international>.\n\n**Last updated: @global.deployment_terms_text**\n_This @global.privacy_policy page was based on a draft created at privacypolicytemplate.net and modified/generated by App Privacy Policy Generator._"
    }
  ],
  "terms_and_conditions": [
    {
      "id": "section_0",
      "title::eng": "User Agreement",
      "text::eng": "These @global.terms_and_conditions are an agreement between you and @global.app_name (or ‘the app’) which furthermore sets out the rules for your use of @global.app_name.\n\n@global.app_name is a free app version of the Parenting for Lifelong Health for Young Children programme and designed for parents and caregivers of children aged 2 to 9 years.\n\n@global.app_name is brought to you by the collaboration of partners including Parenting for Lifelong Health, University of Oxford, IDEMS International, INNODEMS, and the Child Protection Office in the Ministry of Health - State of Kuwait (‘the @global.app_name team’).\n\nPlease read these @global.terms_and_conditions carefully. By downloading or using the app, you agree that you have read, understood, and accepted the @global.terms_and_conditions contained below.\n\nYour privacy is important to us – please also read our @global.privacy_policy, which will detail how we collect, store and use the information that you provide to us. By using @global.app_name you are confirming to us that you are further agreeing to our @global.privacy_policy, as set out separately."
    },
    {
      "id": "section_1",
      "title::eng": "This App Does Not Provide Medical Advice or Care",
      "text::eng": "The content in this app, such as text, images, and information, is for general educational purposes only. It is not a substitute for professional medical advice, diagnosis, treatment, or in-person visits to your doctor. @global.app_name is here to support, not replace, your relationship with your healthcare or other professional provider.\n\nThe information provided is not medical advice and should not be used for diagnosing or treating any health problems. Always consult your doctor regarding any medical concerns you have, and never ignore professional advice based on something you read here. If you think your child might have a medical emergency, contact a doctor or call 112 immediately.\n\n@global.app_name is meant for healthy children without known medical conditions. If any health issues arise, follow up with your child’s healthcare provider, as the app may not be relevant. Using the app is at your own risk."
    },
    {
      "id": "section_2",
      "title::eng": "Children’s Privacy",
      "text::eng": "@global.app_name isn’t meant for children under 18, and we do not knowingly gather personal details from users directly in this age group. "
    },
    {
      "id": "section_3",
      "title::eng": "Rules of Usage",
      "text::eng": "@global.app_name is open-source, meaning its codebase is available on GitHub for the wider software development community. However, altering the existing application or its materials, or replicating any trademarks associated with the @global.app_name team, is against the terms of use. While the app is open-source, translating the software into other languages or creating alternative versions without properly crediting the @global.app_name team is not permitted. Unauthorised access to confidential user data is strictly prohibited.\n\nWhen using the app, we believe you to be providing accurate information about yourself, avoid making false claims of affiliation, and accurately report the app's behaviour. Your use of the app must comply with all relevant local rules and regulations. By accessing and using the app, you confirm that you are not considered a minor in your country of residence."
    },
    {
      "id": "section_4",
      "title::eng": "Content Changes",
      "text::eng": "The @global.app_name team is committed to ensuring that the app is as useful and user friendly as possible. For that reason, we reserve the right to make changes to the app which will be delivered through updates. At present the app is free of charge and our intention is for it to stay that way.\n\nIn the future it is possible that some services may be offered that would incur a cost. We will never charge you for the app or its services without clearly making known to you first any access charges applicable."
    },
    {
      "id": "section_5",
      "title::eng": "Intellectual property",
      "text::eng": "The app, together with its trademarks, copyright, database rights, and all associated intellectual property, is owned by or licensed to the various collaborators of the @global.app_name team. The software code is governed by the GPL 3 licence, while the content is covered under the Creative Commons International 4.0 license. The names, emblems, and logos of collaborating institutions are the exclusive property of those institutions and are protected under both national and international laws. Any unauthorised use is strictly prohibited. Reproducing or copying these logos in any form is not permitted without the prior written consent of the respective institution."
    },
    {
      "id": "section_6",
      "title::eng": "Feedback Submissions",
      "text::eng": "Your feedback on the app is appreciated. So that we can improve, any comments are not considered confidential and will become available for further lawful use without additional approval or compensation. We shall therefore own exclusive rights and believe any feedback that you have made is original by you."
    },
    {
      "id": "section_7",
      "title::eng": "Security",
      "text::eng": "Our app stores and processes personal data that you have provided to us, in order to offer our services. It is your responsibility to keep your phone and access to the app secure. Removal of software restrictions and limitations imposed by the official operating system of your device is therefore not recommended. Doing so could make your phone vulnerable to malware, viruses, malicious programs as well as compromise your phone’s security features and could mean that the app will not work properly or at all.\n\nTo see how we handle your personal information, please refer to our @global.privacy_policy."
    },
    {
      "id": "section_8",
      "title::eng": "External links and resources",
      "text::eng": "The app uses third party services that declare their own @global.terms_and_conditions and may link to other websites and resources that are not under the app's control.\n\nLinks to @global.terms_and_conditions of third party service providers used by the app include:\n-   [Google Play Services](https://policies.google.com/terms)\n-   [Google Analytics for Firebase](https://firebase.google.com/terms/analytics)\n-   [Matomo](https://matomo.org/matomo-cloud-terms-of-service/)\n-   [Supabase](https://supabase.com/terms)\n\nThe inclusion of such links does not imply an endorsement or approval by the app and/or its partners of any website, product, or service. Similarly, the app and the @global.app_name team affiliated developers and collaborators do not assume any responsibility or liability in respect of such websites, product, or service, including, for example, responsibility or liability for the accuracy or reliability of any information, data, opinions, advice or statements made on those web sites."
    },
    {
      "id": "section_9",
      "title::eng": "Disclaimer",
      "text::eng": "Please be aware that the @global.app_name team exclude responsibility for the following:\n\n1. Internet connections required: Certain functions of the app will require the app to have an active internet connection. The @global.app_name team cannot take responsibility for the app not working at full functionality if you do not have access to Wi-Fi, or you do not have any of your data allowance left.\n\n2. Mobile network charges: Using the app outside of an area with Wi-Fi, will mean that your terms of agreement with your mobile network provider will still apply. As a result, you may be charged by your mobile provider for the cost of data for the duration of the connection while accessing the app, or other third party charges. In using the app, you accept responsibility for any such charges, including roaming data charges if you use the app outside of your home territory (i.e. region or country) without turning off data roaming. If you are not the bill payer for the device on which you are using the app, please be aware that we assume that you have received permission from the bill payer for using the app.\n\n3. Third-party information: Although we endeavour to ensure that the app is updated and its content accurate, we do rely on third parties to provide information to us so that we can make it available to you. We do not regularly review all of the external sites and cannot guarantee that they are always accurate or reliable.\n\n4. Limitation of liability: The @global.app_name team accepts no liability for any damage or loss, direct or indirect, you experience as a result of using the app, or arising from any reliance you may place on advice or information provided from the app. You should always exercise your own discretion and judgement appropriate to your own circumstances in relation to any advice or information provided from the app.\n\n5. Viruses and bugs: Any instances of software bugs, viruses or other malicious material transmitted by a third party through our site are a regret, but we are devoid of responsibility.\n\n6. App updates: The app is regularly updated to improve performance and content. The system requirements for the app may change over time, depending on the platform you use (and any additional platforms we may support in the future). It is your responsibility to download updates to continue using the app. The @global.app_name team does not guarantee that the app will always be updated to remain compatible with your device’s operating system. However, you agree to accept any updates to the app when they are offered to you.\n\n7. Availability and termination: The app site might not be available at all times for reasons of maintenance or trouble with associated software or hardware. Whilst we apologise for inconveniences, we are not liable for any loss you may incur should the site not be accessible or is withdrawn. Equally, we have the right and choice to terminate your access and use of the app (including availability of captured data) at any time, without warning. Unless we tell you otherwise, upon any termination, (a) the rights and licences granted to you in these terms will end; (b) you must stop using the app, and (if needed) delete it from your device.\n\n8. Indemnification: You agree to protect and indemnify @global.app_name, along with its officers, directors, employees, agents, licensors, and suppliers, from any claims, actions, demands, liabilities, or settlements, including reasonable legal and accounting costs, arising from or alleged to arise from your breach of these @global.terms_and_conditions.\n\n9. No endorsement: Companies or products associated with the app should not be interpreted as endorsement by the app or the @global.app_name team or demonstrate an intention to infringe proprietary rights."
    },
    {
      "id": "section_10",
      "title::eng": "Governing Law and Jurisdiction",
      "text::eng": "You agree that any dispute with @global.app_name, or related to your use of the App, will be handled exclusively by the courts in the State of Kuwait. You also agree to allow the courts in Kuwait to have authority over you for any such dispute, including claims involving @global.app_name, its affiliates, subsidiaries, employees, contractors, officers, directors, and any associated service or content providers.\n\nThese @global.terms_and_conditions are governed by the laws and regulations of the State of Kuwait, without taking into account any conflict of laws principles. If any part of these @global.terms_and_conditions is found to be invalid by a court, the remaining terms will still apply. No waiver of these @global.terms_and_conditions will be considered a continuing waiver of that term or any other term."
    },
    {
      "id": "section_11",
      "title::eng": "Changes to the @global.terms_and_conditions",
      "text::eng": "We may update our @global.terms_and_conditions from time to time. You waive your right to be notified directly of changes and are advised to review this page periodically for any updates. Your continued use of the app suggests you agree to subsequent revisions of the @global.terms_and_conditions."
    },
    {
      "id": "section_12",
      "title::eng": "Contact Us",
      "text::eng": "If you have any questions or suggestions about our @global.terms_and_conditions, do not hesitate to contact us at <apps@idems.international>.\n\n**Last updated: @global.deployment_terms_text**"
    }
  ],
  "NOTES": []
}